In [2]:
import pandas as pd
import requests

In [3]:
ratings = pd.read_csv("processed_ratings.csv")
ratings.head()

   userid  rating                movie  year                   movieid
0   11880       5      cinema paradiso  1988      cinema+paradiso+1988
1  143289       5     forces of nature  1999     forces+of+nature+1999
2  131839       3                speed  1994                speed+1994
3   83318       4     love  basketball  2000     love++basketball+2000
4   30046       5  saving private ryan  1998  saving+private+ryan+1998

In [14]:
user_api_url = "http://128.2.204.215:8080/user/"
users = [requests.get(user_api_url + str(user)).json() for user in ratings['userid'].unique()]
len(users)

246602

In [15]:
users = list(filter(lambda x: x.get('message','valid userID') != 'invalid userID', users))
len(users)

246600

In [16]:
users = list(map(pd.io.json.json_normalize, users))

In [19]:
users_data = pd.concat(users).reset_index(drop=True)
users_data = users_data.drop_duplicates(subset=['user_id'])

   user_id  age            occupation gender
0    11880   26          K-12 student      M
1   143289   26             scientist      M
2   131839   33  executive/managerial      M
3    83318   30  college/grad student      M
4    30046   30  executive/managerial      M

In [24]:
users_data.to_csv("users.csv", index=False)

In [26]:
users_data.shape

(214834, 4)